app/controllers/customers_controller.rb

INSERT INTO "customers" ("Name", "Phone", "Email", "Adress", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Name", "dhruv"], ["Phone", 1122233], ["Email", "dk@bk.com"], ["Adress", "Asasd"], ["created_at", "2021-10-27 16:30:25.251810"], ["updated_at", "2021-10-27 16:30:25.251810"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save