app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("SKU", "MRP", "Qunatity", "Discount", "Net_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["SKU", 100], ["MRP", 100], ["Qunatity", 2], ["Discount", 0], ["Net_price", 15], ["created_at", "2021-10-27 17:47:51.572762"], ["updated_at", "2021-10-27 17:47:51.572762"]]